Revit 2024 API
StairsLanding.Thickness Property
 The thickness of the landing.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double Thickness { get; }
Visual Basic
Public ReadOnly Property Thickness As Double
	Get
Visual C++
public:
property double Thickness {
	double get ();
}
See Also
StairsLanding Class
Autodesk.Revit.DB.Architecture Namespace